app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
						<td>♡</td>
						<td>コメント数：<%= @book.book_comments.count %></td>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 4]]
---
						<td>♡</td>
						<td>コメント数：<%= @book.book_comments.count %></td>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT  1 AS one FROM "book_comments" WHERE "book_comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
---

		<% if @book.book_comments.any? %>
			<table class="table">
				<% @book.book_comments.each do |comment| %>