app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("body", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "asdfddd"], ["book_id", 1], ["created_at", "2020-04-02 09:40:28.171152"], ["updated_at", "2020-04-02 09:40:28.171152"]]
---
  def create
    @book = Book.find(params[:book_id])
    @book.book_comments.user_id = current_user
    @book.book_comments.create(book_comment_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? AND "book_comments"."id" = ? LIMIT ?  [["book_id", 1], ["id", 16], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 16]]
---
  def destroy
    @book = Book.find(params[:book_id])
    @comment = @book.book_comments.find(params[:id])
    @comment.destroy